; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-4-7)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p1-0 - location
	p1-3 - location
	p1-5 - location
	p2-0 - location
	p2-4 - location
	p3-0 - location
	p3-2 - location
	p4-0 - location
	p4-1 - location
	p5-3 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s3)
	(at driver3 s2)
	(at driver4 s0)
	(at truck1 s3)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at package1 s4)
	(at package2 s0)
	(at package3 s2)
	(at package4 s0)
	(at package5 s5)
	(at package6 s1)
	(at package7 s1)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 79)
	(= (time-to-walk p1-0 s1) 79)
	(= (time-to-walk s0 p1-0) 35)
	(= (time-to-walk p1-0 s0) 35)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(= (time-to-walk s1 p1-3) 71)
	(= (time-to-walk p1-3 s1) 71)
	(= (time-to-walk s3 p1-3) 52)
	(= (time-to-walk p1-3 s3) 52)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(= (time-to-walk s1 p1-5) 54)
	(= (time-to-walk p1-5 s1) 54)
	(= (time-to-walk s5 p1-5) 61)
	(= (time-to-walk p1-5 s5) 61)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 68)
	(= (time-to-walk p2-0 s2) 68)
	(= (time-to-walk s0 p2-0) 63)
	(= (time-to-walk p2-0 s0) 63)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 13)
	(= (time-to-walk p2-4 s2) 13)
	(= (time-to-walk s4 p2-4) 48)
	(= (time-to-walk p2-4 s4) 48)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 38)
	(= (time-to-walk p3-0 s3) 38)
	(= (time-to-walk s0 p3-0) 38)
	(= (time-to-walk p3-0 s0) 38)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(= (time-to-walk s3 p3-2) 84)
	(= (time-to-walk p3-2 s3) 84)
	(= (time-to-walk s2 p3-2) 45)
	(= (time-to-walk p3-2 s2) 45)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 70)
	(= (time-to-walk p4-0 s4) 70)
	(= (time-to-walk s0 p4-0) 80)
	(= (time-to-walk p4-0 s0) 80)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(= (time-to-walk s4 p4-1) 86)
	(= (time-to-walk p4-1 s4) 86)
	(= (time-to-walk s1 p4-1) 82)
	(= (time-to-walk p4-1 s1) 82)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(= (time-to-walk s5 p5-3) 49)
	(= (time-to-walk p5-3 s5) 49)
	(= (time-to-walk s3 p5-3) 92)
	(= (time-to-walk p5-3 s3) 92)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 58)
	(= (time-to-drive s1 s0) 58)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 27)
	(= (time-to-drive s2 s0) 27)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 90)
	(= (time-to-drive s3 s0) 90)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 81)
	(= (time-to-drive s4 s0) 81)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 86)
	(= (time-to-drive s4 s1) 86)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 7)
	(= (time-to-drive s1 s2) 7)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 17)
	(= (time-to-drive s4 s3) 17)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 15)
	(= (time-to-drive s5 s3) 15)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 40)
	(= (time-to-drive s2 s4) 40)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 7)
	(= (time-to-drive s1 s5) 7)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 54)
	(= (time-to-drive s2 s5) 54)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 19)
	(= (time-to-drive s4 s5) 19)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s4)
	(at driver2 s0)
	(at truck1 s0)
	(at truck2 s1)
	(at truck4 s3)
	(at package1 s1)
	(at package2 s1)
	(at package3 s0)
	(at package4 s4)
	(at package5 s1)
	(at package6 s2)
	(at package7 s5)
	))

(:metric minimize (+ (+ (* 2  (total-time)) (* 1  (driven))) (* 3  (walked))))

)

; plan
1. (load-truck package2 truck4 s0)
   deleted: (at package2 s0)
   added: (in package2 truck4)
   goals met: 1 of 12
2. (board-truck driver3 truck2 s2)
   deleted: (at driver3 s2) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 1 of 12
3. (load-truck package3 truck2 s2)
   deleted: (at package3 s2)
   added: (in package3 truck2)
   goals met: 1 of 12
4. (board-truck driver4 truck4 s0)
   deleted: (at driver4 s0) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 1 of 12
5. (drive-truck truck2 s2 s1 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (driven) from 0 to 7
   goals met: 2 of 12
6. (load-truck package4 truck4 s0)
   deleted: (at package4 s0)
   added: (in package4 truck4)
   goals met: 2 of 12
7. (load-truck package6 truck2 s1)
   deleted: (at package6 s1)
   added: (in package6 truck2)
   goals met: 2 of 12
8. (load-truck package7 truck2 s1)
   deleted: (at package7 s1)
   added: (in package7 truck2)
   goals met: 2 of 12
9. (drive-truck truck4 s0 s4 driver4)
   deleted: (at truck4 s0)
   added: (at truck4 s4)
   changed: (driven) from 7 to 88
   goals met: 2 of 12
10. (board-truck driver2 truck1 s3)
   deleted: (at driver2 s3) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 2 of 12
11. (drive-truck truck1 s3 s0 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   changed: (driven) from 88 to 178
   goals met: 3 of 12
12. (load-truck package1 truck4 s4)
   deleted: (at package1 s4)
   added: (in package1 truck4)
   goals met: 3 of 12
13. (unload-truck package4 truck4 s4)
   deleted: (in package4 truck4)
   added: (at package4 s4)
   goals met: 4 of 12
14. (disembark-truck driver2 truck1 s0)
   deleted: (driving driver2 truck1)
   added: (at driver2 s0) (empty truck1)
   goals met: 5 of 12
15. (drive-truck truck4 s4 s1 driver4)
   deleted: (at truck4 s4)
   added: (at truck4 s1)
   changed: (driven) from 178 to 264
   goals met: 5 of 12
16. (unload-truck package1 truck4 s1)
   deleted: (in package1 truck4)
   added: (at package1 s1)
   goals met: 6 of 12
17. (unload-truck package2 truck4 s1)
   deleted: (in package2 truck4)
   added: (at package2 s1)
   goals met: 7 of 12
18. (drive-truck truck4 s1 s5 driver4)
   deleted: (at truck4 s1)
   added: (at truck4 s5)
   changed: (driven) from 264 to 271
   goals met: 7 of 12
19. (drive-truck truck4 s5 s3 driver4)
   deleted: (at truck4 s5)
   added: (at truck4 s3)
   changed: (driven) from 271 to 286
   goals met: 8 of 12
20. (drive-truck truck2 s1 s2 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (driven) from 286 to 293
   goals met: 7 of 12
21. (unload-truck package6 truck2 s2)
   deleted: (in package6 truck2)
   added: (at package6 s2)
   goals met: 8 of 12
22. (drive-truck truck2 s2 s1 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (driven) from 293 to 300
   goals met: 9 of 12
23. (drive-truck truck4 s3 s5 driver4)
   deleted: (at truck4 s3)
   added: (at truck4 s5)
   changed: (driven) from 300 to 315
   goals met: 8 of 12
24. (load-truck package5 truck4 s5)
   deleted: (at package5 s5)
   added: (in package5 truck4)
   goals met: 8 of 12
25. (drive-truck truck4 s5 s1 driver4)
   deleted: (at truck4 s5)
   added: (at truck4 s1)
   changed: (driven) from 315 to 322
   goals met: 8 of 12
26. (unload-truck package5 truck4 s1)
   deleted: (in package5 truck4)
   added: (at package5 s1)
   goals met: 9 of 12
27. (drive-truck truck4 s1 s5 driver4)
   deleted: (at truck4 s1)
   added: (at truck4 s5)
   changed: (driven) from 322 to 329
   goals met: 9 of 12
28. (drive-truck truck2 s1 s0 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (driven) from 329 to 387
   goals met: 8 of 12
29. (unload-truck package3 truck2 s0)
   deleted: (in package3 truck2)
   added: (at package3 s0)
   goals met: 9 of 12
30. (drive-truck truck2 s0 s1 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (driven) from 387 to 445
   goals met: 10 of 12
31. (drive-truck truck4 s5 s3 driver4)
   deleted: (at truck4 s5)
   added: (at truck4 s3)
   changed: (driven) from 445 to 460
   goals met: 11 of 12
32. (drive-truck truck2 s1 s5 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   changed: (driven) from 460 to 467
   goals met: 10 of 12
33. (unload-truck package7 truck2 s5)
   deleted: (in package7 truck2)
   added: (at package7 s5)
   goals met: 11 of 12
34. (drive-truck truck2 s5 s1 driver3)
   deleted: (at truck2 s5)
   added: (at truck2 s1)
   changed: (driven) from 467 to 474
   goals met: 12 of 12
